In [1]:
import pandas as pd

In [2]:
df1 = pd.DataFrame({
    'name': ['Alice', 'Bob', 'Charlie'],
    'age': [25, 30, 35],
    'city': ['New York', 'Chicago', 'San Francisco']
})
df1

      name  age           city
0    Alice   25       New York
1      Bob   30        Chicago
2  Charlie   35  San Francisco

In [3]:
df2 = pd.DataFrame({
    'name': ['Dave', 'Eve', 'Charlie'],
    'age': [40, 45, 35],
    'state': ['Texas', 'California', 'California']
})

In [5]:
union_df = pd.concat([df1, df2])
union_df

      name  age           city       state
0    Alice   25       New York         NaN
1      Bob   30        Chicago         NaN
2  Charlie   35  San Francisco         NaN
0     Dave   40            NaN       Texas
1      Eve   45            NaN  California
2  Charlie   35            NaN  California

In [6]:
# Reset the index of the union DataFrame
union_df = union_df.reset_index(drop=True)
union_df

      name  age           city       state
0    Alice   25       New York         NaN
1      Bob   30        Chicago         NaN
2  Charlie   35  San Francisco         NaN
3     Dave   40            NaN       Texas
4      Eve   45            NaN  California
5  Charlie   35            NaN  California